---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidProfile
source: html/d784cddb-c632-f29d-9b9c-2902068b1e3d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidProfile Property

One or more profiles are invalid. Make sure that every used profile is a closed loop of non-intersecting lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidProfile { get; }
```